StartMilandr/MDR_Pack_v6/PACK_Gen/Milandr.MDR1986VExx.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Milandr</vendor>
  <url>https://ic.milandr.ru/soft/</url>
  <name>MDR1986VExx</name>
  <description>Milandr MDR1986VExx Series Device Support, Drivers and Examples</description>  

  <releases>
    <release version="2.0x" date="2019-05-07">
      - 2.0: Start Version
      - 2.01: Personal Config and VE8, VK014, ElSila headers added
      - 2.02: 1636RR52 flash memory driver added
      - 2.0x: Increment paused
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Milandr</keyword>
    <keyword>MDR</keyword>
    <keyword>MDR1986VE</keyword>
  </keywords>

  <devices>
    <family Dfamily="StartMilandr" Dvendor="Milandr:99">
    
      <book name="Books/RST.pdf" title="Clock Quick Reference"/>
      <book name="Books/GPIO.pdf" title="GPIO Quick Reference"/>
      <book name="Books/EEPROM.pdf" title="EEPROM Quick Reference"/>
      <book name="Books/BKP.pdf" title="BKP and RTC Quick Reference"/>
      <book name="Books/ADC.pdf" title="ADC Quick Reference"/>
      <book name="Books/SSP.pdf" title="SSP Quick Reference"/>
      <book name="Books/UART.pdf" title="UART Quick Reference"/>
      <book name="Books/Timer.pdf" title="Timer Quick Reference"/>
      <book name="Books/ADCUI_VK214.pdf" title="ADCUI VK214 Quick Reference"/>
      <book name="Books/ADCUI_VK234.pdf" title="ADCUI VK234 Quick Reference"/>
      <book name="Books/WDT.pdf" title="WWDT and IWDT Quick Reference"/>
      <book name="Books/LCD_VK214.pdf" title="LCD VK214 Quick Reference"/>
      <book name="Books/Power.pdf" title="Power Quick Reference"/>
      <book name="Books/DMA.pdf" title="DMA Quick Reference"/>
      <book name="Books/CRC_VK234.pdf" title="CRC VK234 Quick Reference"/>
      <book name="Books/I2C.pdf" title="I2C Quick Reference"/>

      <subFamily DsubFamily="Cortex-M0">
        <processor  Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="36000000"/>
        <!-- MDR1986VE4 -->
        <device Dname="MDR1986VE4" >
          <!--processor  Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="36000000"/-->
          <compile    header="SPL/Devices/MDR1986VE4/MDR_1986VE4.h" define="USE_MDR1986VE4"/>
          <debug      svd="Keil/SVD/MDR1986VE4.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Keil/FLM/MDR1986VE4_EEPROM.FLM" start="0x00000000"  size="0x20000" RAMstart="0x20000000" RAMsize="0x4000" default="1"/>
          <!--book       name="doc/1986VE4Y.pdf" title="1986VE4 Reference Manual"/-->

          <description>
                (1986VE4 RUS)
                Core:
                 - 32-bit ARM Cortex-M0 processor, running at frequencies of up to 36 MHz
                 - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
                 - memory Protection Unit (MPU)
                 - 24-bit SysTick Timer

                Memory:
                 - 128 KBytes of Flash memory (ISP and IAP)
                 - 16 KBytes of SRAM

                Supply and Clock rate:
                 - internal regulator for core voltage supply
                 - built-in power control system
                 - internal battery domain
                 - internal 8 MHz RC clock generator with calibration
                 - internal 40 kHz RC clockgenerator with calibration
                 - external oscillator 2 .. 16 MHz
                 - external oscillator 32 KHz
                 - on-board PLL for clock frequency
                 - dedicated PLL for USB clock frequency

                Low power consumption modes:
                 - Sleep, Stop and Standby
                 - battery domain with RTC and backup registers

                Analog features:
                 - 12-bit ADC (8 channels)
                 - 24-bit Sigma-Delta ADC (8 channels)
                 - conversion range: 0 to 3.6 V
                 - temperature sensor
                 - 12-bit DAC
                 - internal comparator

                Peripheral features:
                 - DMA controller (32 channel)
                 - 2 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
                 - 2 * UART
                 - 1 * SPI
                 - 36 GPIO pins

                Debug mode:
                 - 1 SWD
          </description>
          <feature type="UART"  n="2"   name="UART Interface up to 2.25 Mbit/s"/>
          <feature type="VCC"   n="2.2" m="3.6"/>
          <feature type="DAC"   n="1"   m="12"/>
          <feature type="ADC"   n="1"   m="12"/>
          <feature type="SPI"   n="1"   name="SPI Interface"/>
          <feature type="Timer" n="2"   m="16" name="General Purpose Timer"/>
        </device>

        <!-- MDR1986VK214 -->
        <device Dname="MDR1986VK214" >
          <!--processor  Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="36000000"/-->
          <compile    header="SPL/Devices/MDR1986VK214/MDR_1986VK214.h" define="USE_MDR1986VK214"/>
          <debug      svd="Keil/SVD/MDR1986VK214.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Keil/FLM/MDR1986VKx_EEPROM.FLM" start="0x00000000"  size="0x20000" RAMstart="0x20000000" RAMsize="0x4000" default="1"/>
          <!--book       name="doc/K1986VK214.pdf" title="1986VE4 Reference Manual"/-->

          <description>
                (1986VK214 RUS)
                Core:
                 - 32-bit ARM Cortex-M0 processor, running at frequencies of up to 36 MHz
                 - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
                 - memory Protection Unit (MPU)
                 - 24-bit SysTick Timer

