StartMilandr/MDR_Pack_v6/PACK_Gen/Milandr.MDR1986VExx.pdsc
            Memory:
             - 128 KBytes of Flash memory (ISP and IAP)
             - 32 KBytes of SRAM
             - external system bus controller (support of SRAM, ROM and NAND Flash)

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - external oscillator 2 .. 16 MHz
             - external oscillator 32 KHz
             - on-board PLL for clock frequency
             - dedicated PLL for USB clock frequency

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers

            Analog features:
             - 2 * 12-bit ADC (16 channels)
             - conversion range: 0 to 3.6 V
             - temperature sensor
             - 1 * 12-bit DAC
             - internal comparator

            Peripheral features:
             - DMA controller (32 channel)
             - USB 2.0 full-speed OTG controller (Device and Host)
             - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
             - 2 * CAN interface (2.0B)
             - 3 * UART
             - 2 * SPI
             - 1 * I2C
             - 96 GPIO pins

            Debug mode:
             - 2 * JTAG and SWD
          </description>
        </device> 

      </subFamily>

      <subFamily DsubFamily="Cortex-M4F">
        <!--Core description-->
        <device Dname="MDR1986VE8">
          <processor  Dcore="Cortex-M4" DcoreVersion="r0p0" Dfpu="FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="64000000"/>
          <compile header="SPL/Devices/MDR1986VE8/MDR_1986VE8.h" define="USE_MDR1986VE8"/>
          <debug      svd="Keil/SVD/MDR1986VE8.svd"/>
          <memory     id="IROM1"                          start="0x20006000"  size="0x2000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x6000"    init   ="1"   default="1"/>
          <!--algorithm  name="Flash\"           start="0x08000000"  size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/-->
          <description>
            (1986BE8 RUS)
            Core:
             - 32-bit ARM Cortex-M4 processor, running at frequencies of up to 60 MHz
             - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
             - memory Protection Unit (MPU)
             - 24-bit SysTick Timer

            Memory:
             - 128 KBytes of OTP w\ECC(SEC-DEC)
             - 32 KBytes of SRAM w\ECC(SEC-DEC)
             - external system bus controller w\ECC(SEC-DEC)

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - 2x external oscillator 1 .. 30 MHz
             - 3x on-board PLL for clock frequency

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers

            Analog features:
             - 2x 12-bit ADC (16 channels)
             - 2x 12-bit DAC

            Peripheral features:
             - EthernetMAC 10/100
             - EthernetPHY 10
             - SpaceWire
             - ARINC 429 
             - MILSTD
             - 1xCAN, 1xSSP, 1xUART, 1xDMA, 4xTimer
             - RTC
             - WDG
             - 160x GPIO

            Debug mode:
             - 2x JTAG
          </description>
        </device>
        <!-- MDR_ESila -->
        <device Dname="MDR_ESila" >
          <processor  Dcore="Cortex-M4" DcoreVersion="r0p0" Dfpu="FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="160000000"/>
          <compile    header="SPL/Devices/MDR_ESila/MDR_ESila.h" define="USE_ESila"/>
          <debug      svd="Keil/SVD/MDR_ESila.svd"/>
          <memory     id="IROM1"                          start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Keil/FLM/MLDR124_LOCK.FLM.FLM" start="0x01000000"  size="0x100000" RAMstart="0x20000000" RAMsize="0xF000" default="1"/>
          <description>
                (ESila RUS)
                Core:
                 - Dualcore 32-bit ARM Cortex-M4F processor, running at frequencies of up to 160 MHz
                 - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
                 - memory Protection Unit (MPU)
                 - 24-bit SysTick Timer

                Memory:
                 - 1 MBytes of Code SRAM (ISP and IAP)
                 - 256 KBytes of Data SRAM

                Supply and Clock rate:
                 - internal regulator for core voltage supply
                 - built-in power control system
                 - internal battery domain
                 - internal 8 MHz RC clock generator with calibration
                 - internal 40 kHz RC clockgenerator with calibration
                 - external oscillator 2 .. 16 MHz
                 - external oscillator 32 KHz
                 - on-board PLL for clock frequency
                 - dedicated PLL for USB clock frequency
          </description>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <condition id="CON_MDR_ALL">
      <description>All 32-bit Cortex devices</description>
      <accept Dname="MDR1986VE1"/>
      <accept Dname="MDR1986VE3"/>
      <accept Dname="MDR1986VE4"/>
      <accept Dname="MDR1986VK214"/>
      <accept Dname="MDR1986VK234"/>
      <accept Dname="MDR1986VE91"/>
      <accept Dname="MDR1986VE92"/>
      <accept Dname="MDR1986VE93"/>
      <accept Dname="MDR1986VE94"/>
      <accept Dname="MDR1901VC1"/>
      <accept Dname="MDR1986VE8"/>
      <accept Dname="MDR1923VK014"/>
      <accept Dname="MDR_ESila"/>
    </condition>
    <condition id="CON_HAS_DMA">
      <description>Devices with DMA</description>
      <accept Dname="MDR1986VE1"/>
      <accept Dname="MDR1986VE3"/>
      <accept Dname="MDR1986VE4"/>
      <accept Dname="MDR1986VK234"/>
      <accept Dname="MDR1986VE91"/>
      <accept Dname="MDR1986VE92"/>
      <accept Dname="MDR1986VE93"/>
      <accept Dname="MDR1986VE94"/>
      <accept Dname="MDR1901VC1"/>
      <accept Dname="MDR1986VE8"/>
      <accept Dname="MDR1923VK014"/>
      <accept Dname="MDR_ESila"/>
    </condition>
    <condition id="CON_HAS_I2C">
      <description>Devices with I2C</description>
      <accept Dname="MDR1986VK214"/>
      <accept Dname="MDR1986VE91"/>
      <accept Dname="MDR1986VE92"/>
      <accept Dname="MDR1986VE93"/>
      <accept Dname="MDR1986VE94"/>
      <accept Dname="MDR1901VC1"/>
    </condition>
