StartMilandr/MDR_Pack_v6/PACK_Gen/Milandr.MDR1986VExx.pdsc
    <condition id="CON_HAS_CRC_VE4x">
      <description>Devices with CRC</description>
      <accept Dname="MDR1986VE4"/>
      <accept Dname="MDR1986VK234"/>
    </condition>
    <condition id="CON_MDR_UseFuncs">
      <description>Support types and funcs</description>
      <require Cclass="Drivers" Cgroup="UseFuncs"/>
    </condition>
    <condition id="CON_MDR1986VE4">
      <description>Cortex-M0 MDR1986VE4 device</description>
      <accept Dname="MDR1986VE4"/>
    </condition>
    <condition id="CON_MDR1986VK214">
      <description>Cortex-M0 MDR1986VK214 device</description>
      <accept Dname="MDR1986VK214"/>
    </condition>
    <condition id="CON_MDR1986VK234">
      <description>Cortex-M0 MDR1986VK234 device</description>
      <accept Dname="MDR1986VK234"/>
    </condition>
    <condition id="CON_MDR1986VE1">
      <description>Cortex-M1 MDR1986VE1 device</description>
      <accept Dname="MDR1986VE1"/>
    </condition>
    <condition id="CON_MDR1986VE3">
      <description>Cortex-M1 MDR1986VE3 device</description>
      <accept Dname="MDR1986VE3"/>
    </condition>
    <condition id="CON_MDR1986VE9x">
      <description>Cortex-M3 MDR1986VE9x device</description>
      <accept Dname="MDR1986VE91"/>
      <accept Dname="MDR1986VE92"/>
      <accept Dname="MDR1986VE93"/>
      <accept Dname="MDR1986VE94"/>
    </condition>
    <condition id="CON_MDR1901VC1">
      <description>Cortex-M3 device with DSP Core</description>
      <accept Dname="MDR1901VC1"/>
    </condition>
    <condition id="CON_MDR1986VE8">
      <description>Cortex-M4F device</description>
      <accept Dname="MDR1986VE8"/>
    </condition>
    <condition id="CON_MDR1923VK014">
      <description>Cortex-M0 device</description>
      <accept Dname="MDR1923VK014"/>
    </condition>
    <condition id="CON_ESila">
      <description>Cortex-M4F device</description>
      <accept Dname="MDR_ESila"/>
    </condition>
    <condition id="Startup ARM">
      <description>Startup assembler file for ARMCC</description>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CON_MDR_CM1CM3">
      <description>All 32-bit Cortex devices</description>
      <accept Dname="MDR1986VE1"/>
      <accept Dname="MDR1986VE3"/>
      <accept Dname="MDR1986VE91"/>
      <accept Dname="MDR1986VE92"/>
      <accept Dname="MDR1986VE93"/>
      <accept Dname="MDR1986VE94"/>
      <accept Dname="MDR1901VC1"/>
    </condition>
    <condition id="CON_MDR_CM0">
      <description>All 32-bit Cortex devices</description>
      <accept Dname="MDR1986VE4"/>
      <accept Dname="MDR1986VK214"/>
      <accept Dname="MDR1986VK234"/>
    </condition>
    <condition id="CON_MDR_VE8x">
      <description>32-bit Cortex devices like VE8</description>
      <accept Dname="MDR_ESila"/>
      <accept Dname="MDR1986VE8"/>
      <accept Dname="MDR1923VK014"/>
    </condition>
    <!--condition id="CON_MDR_CM0VK">
      <description>All 32-bit Cortex devices</description>
      <accept Dname="MDR1986VK214"/>
      <accept Dname="MDR1986VK234"/>
    </condition-->

  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1986VE4">
      <description>System Startup for Cortex-M0 device series</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1986VE4/"/>
        <file category="source"  name="SPL/Devices/MDR1986VE4/startup_MDR1986VE4.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1986VE4/system_MDR1986VE4.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1986VE4/system_MDR1986VE4.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVE4.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1986VK214">
      <description>System Startup for Cortex-M0 device series</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1986VK214/"/>
        <file category="source"  name="SPL/Devices/MDR1986VK214/startup_MDR1986VK214.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1986VK214/system_MDR1986VK214.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1986VK214/system_MDR1986VK214.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVK214.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1986VK234">
      <description>System Startup for Cortex-M0 device series</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1986VK234/"/>
        <file category="source"  name="SPL/Devices/MDR1986VK234/startup_MDR1986VK234.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1986VK234/system_MDR1986VK234.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1986VK234/system_MDR1986VK234.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVK234.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1986VE1">
      <description>System Startup for Cortex-M1 device series</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1986VE1/"/>
        <file category="source"  name="SPL/Devices/MDR1986VE1/startup_MDR1986VE1.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1986VE1/system_MDR1986VE1.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1986VE1/system_MDR1986VE1.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVE1.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1986VE3">
      <description>System Startup for Cortex-M1 device series</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1986VE3/"/>
        <file category="source"  name="SPL/Devices/MDR1986VE3/startup_MDR1986VE3.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1986VE3/system_MDR1986VE3.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1986VE3/system_MDR1986VE3.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVE3.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1986VE9x">
      <description>System Startup for Cortex-M3 device series</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1986VE9x/"/>
        <file category="source"  name="SPL/Devices/MDR1986VE9x/startup_MDR1986VE9x.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1986VE9x/system_MDR1986VE9x.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1986VE9x/system_MDR1986VE9x.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVE9x.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1901VC1">
      <description>System Startup for Cortex-M3 device with DSP Core</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1901VC1/"/>
        <file category="source"  name="SPL/Devices/MDR1901VC1/startup_MDR1901VC1.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1901VC1/system_MDR1901VC1.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1901VC1/system_MDR1901VC1.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVC1.h" attr="config" version="2.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1986VE8">
      <description>System Startup for Cortex-M4F</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1986VE8/"/>
        <file category="source"  name="SPL/Devices/MDR1986VE8/startup_MDR1986VE8.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1986VE8/system_MDR1986VE8.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1986VE8/system_MDR1986VE8.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVE8.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_MDR1923VK014">
      <description>System Startup for Cortex-M4F</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR1923VK014/"/>
        <file category="source"  name="SPL/Devices/MDR1923VK014/startup_MDR1923VK014.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR1923VK014/system_MDR1923VK014.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR1923VK014/system_MDR1923VK014.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigVK014.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0" condition="CON_ESila">
      <description>System Startup for Cortex-M4F</description>
      <files>
        <file category="include" name="Keil/CMSIS_Core/"/>
        <file category="include" name="SPL/Config/"/>
        <file category="include" name="SPL/Devices/Defines/"/>
        <file category="include" name="SPL/Devices/MDR_ESila/"/>
        <file category="source"  name="SPL/Devices/MDR_ESila/startup_ESila.s" attr="config" condition="Startup ARM" version="2.0.0"/>
        <file category="source"  name="SPL/Devices/MDR_ESila/system_ESila.c"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Devices/MDR_ESila/system_ESila.h"  attr="config" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDR_ConfigESila.h" attr="config" version="2.0.0"/>
      </files>
    </component>

    <!-- RST_CLOCK Driver -->
    <component Cclass="Drivers" Cgroup="RST Clock" Cversion="2.0" condition="CON_MDR_UseFuncs">
      <description>CPU Clock driver for MDR1986VExx Series</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_RST_Clock.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_RST_Clock.c" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Drivers" Cgroup="RST Clock" Cversion="2.0" condition="CON_MDR_VE8x">
      <description>CPU Clock driver for MDR1986VExx Series</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_RST_Clock_VE8x.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_RST_Clock_VE8x.c" version="2.0.0"/>
      </files>
    </component>
