StartMilandr/MDR_Pack_v6/PACK_Gen/Milandr.MDR1986VExx.pdsc
    <!-- GPIO PORT Driver -->
    <component Cclass="Drivers" Cgroup="GPIO Port" Cversion="2.0" condition="CON_MDR_UseFuncs">
      <description>PORT driver for MDR1986VExx Series</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_GPIO.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_GPIO.c" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Drivers" Cgroup="GPIO Port" Cversion="2.0" condition="CON_MDR_VE8x">
      <description>PORT driver for MDR1986VExx Series</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_GPIO_VE8x.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_GPIO_VE8x.c" version="2.0.0"/>
      </files>
    </component>    
    <!-- SysTimer -->
    <component Cclass="Drivers" Cgroup="SysTimer" Cversion="2.0" condition="CON_MDR_ALL">
      <description>Core System Timer</description>      
      <files>
        <file category="header"  name="SPL/Drivers/MDR_SysTimer.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_SysTimer.c" version="2.0.0"/>
      </files>
    </component>    
    <!-- EEPROM -->
    <component Cclass="Drivers" Cgroup="EEPROM" Cversion="2.0" condition="CON_MDR_CM1CM3">
      <description>EEPROM Control</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_EEPROM.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_EEPROM.c" version="2.0.0"/>
      </files>
    </component> 
    <!-- EEPROM 18MHz-->
    <component Cclass="Drivers" Cgroup="EEPROM" Cversion="2.0" condition="CON_MDR_CM0">
      <description>EEPROM Control</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_EEPROM.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_EEPROM_18MHz.c" version="2.0.0"/>
      </files>
    </component> 
    <!-- BKP RTC -->
    <component Cclass="Drivers" Cgroup="Backup and RTC" Cversion="2.0" condition="CON_MDR_ALL">
      <description>Backup and RTC</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_BKP_RTC.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_BKP_RTC.c" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Drivers" Cgroup="Backup and RTC" Cversion="2.0" condition="CON_MDR_VE8x">
      <description>Backup and RTC</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_BKP_RTC_VE8x.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_BKP_RTC_VE8x.c" version="2.0.0"/>
      </files>
    </component>
    <!--Device.Support-->
    <component Cclass="Drivers" Cgroup="UseFuncs" Cversion="2.0" condition="CON_MDR_ALL">
      <description>Types and Functions for SPL</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_Funcs.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_Funcs.c" version="2.0.0"/>
      </files>
    </component>
    <!--ADC-->
    <component Cclass="Drivers" Cgroup="ADC" Cversion="2.0" condition="CON_MDR_ALL">
      <description>SAR ADC Control functions</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_ADC.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_ADC.c" version="2.0.0"/>
      </files>
    </component>
    <!--PER_Clock-->
    <component Cclass="Drivers" Cgroup="PER_Clock" Cversion="2.0" condition="CON_MDR_CM1CM3">
      <description>Peripherial clock select functions</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_PER_Clock.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_PER_Clock.c" version="2.0.0"/>
      </files>
    </component>    
    <component Cclass="Drivers" Cgroup="PER_Clock" Cversion="2.0" condition="CON_MDR_CM0">
      <description>Peripherial clock select functions</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_PER_Clock.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_PER_ClockVE4.c" version="2.0.0"/>
      </files>
    </component>
    <!--SSP-->
    <component Cclass="Drivers" Cgroup="SSP" Cversion="2.0" condition="CON_MDR_ALL">
      <description>Synchronous Serial Port</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_SSP.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_SSP.c" version="2.0.0"/>
      </files>
    </component>
    <!--UART-->
    <component Cclass="Drivers" Cgroup="UART" Cversion="2.0" condition="CON_MDR_ALL">
      <description>UART driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_UART.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_UART.c" version="2.0.0"/>
      </files>
    </component>
    <!--Timer-->
    <component Cclass="Drivers" Cgroup="Timer" Cversion="2.0" condition="CON_MDR_ALL">
      <description>Timer driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_Timer.h" version="2.0.0"/>
        <file category="source"  name="SPL/Drivers/MDR_Timer.c" version="2.0.0"/>
      </files>
    </component>     
    <!-- ADCUI Driver -->
    <component Cclass="Drivers" Cgroup="ADCUI" Cversion="2.0" condition="CON_MDR1986VK214">
      <description>ADCUI driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_ADCUI_VK214.h"/>
        <file category="source"  name="SPL/Drivers/MDR_ADCUI_VK214.c"/>
      </files>
    </component>
    <!-- ADCUI Driver -->
    <component Cclass="Drivers" Cgroup="ADCUI" Cversion="2.0" condition="CON_MDR1986VK234">
      <description>ADCUI driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_ADCUI_VK234.h"/>
        <file category="source"  name="SPL/Drivers/MDR_ADCUI_VK234.c"/>
      </files>
    </component>    
	  <!-- WWDG Driver -->
    <component Cclass="Drivers" Cgroup="WWDG" Cversion="2.0" condition="CON_MDR_ALL">
      <description>WWDG driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_WWDT.h"/>
        <file category="source"  name="SPL/Drivers/MDR_WWDT.c"/>
      </files>
    </component>    
    <!-- IWDG Driver -->
    <component Cclass="Drivers" Cgroup="IWDG" Cversion="2.0" condition="CON_MDR_ALL">
      <description>IWDG driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_IWDT.h"/>
        <file category="source"  name="SPL/Drivers/MDR_IWDT.c"/>
      </files>
    </component>
    <!-- LCD Driver -->
    <component Cclass="Drivers" Cgroup="LCD" Cversion="2.0" condition="CON_MDR1986VK214">
      <description>LCD driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_LCD_VK214.h"/>
        <file category="source"  name="SPL/Drivers/MDR_LCD_VK214.c"/>
      </files>
    </component>
    <!-- POWER Driver -->
    <component Cclass="Drivers" Cgroup="POWER" Cversion="2.0" condition="CON_MDR_ALL">
      <description>POWER driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_Power.h"/>
        <file category="source"  name="SPL/Drivers/MDR_Power.c"/>
      </files>
    </component>
    <!-- DMA Driver -->
    <component Cclass="Drivers" Cgroup="DMA" Cversion="1.9" condition="CON_HAS_DMA">
      <description>DMA driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_DMA.h"/>
        <file category="source"  name="SPL/Drivers/MDR_DMA.c"/>
      </files>
    </component>     
    <!-- CRC  Driver -->
    <component Cclass="Drivers" Cgroup="CRC" Cversion="2.0" condition="CON_HAS_CRC_VE4x">
      <description>CRC driver for 1986VE4 and 1986VK234</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_CRC.h"/>
        <file category="source"  name="SPL/Drivers/MDR_CRC_VE4x.c"/>
      </files>
    </component>
