StartMilandr/MDR_Pack_v6/PACK_Gen/Milandr.MDR1986VExx.pdsc
    <!-- I2C Driver -->
    <component Cclass="Drivers" Cgroup="I2C" Cversion="2.0" condition="CON_HAS_I2C">
      <description>I2C driver</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/" version="2.0.0"/>
        <file category="header"  name="SPL/Drivers/MDR_I2C.h"/>
        <file category="source"  name="SPL/Drivers/MDR_I2C.c"/>
      </files>
    </component>    
    <!-- 1636RR52 Driver -->
    <component Cclass="Drivers" Cgroup="1636RR52" Cversion="2.0" condition="CON_MDR_ALL">
      <description>1636RR52 flash memory SPI driver</description>
      <files>
        <file category="header"  name="SPL/Drivers/MDR_1636RR52.h"/>
        <file category="source"  name="SPL/Drivers/MDR_1636RR52.c"/>
      </files>
    </component> 

    <!--Boards-->
    <component Cclass="Board Support" Cgroup="LED" Cversion="2.0" condition="CON_MDR_ALL">
      <description>LED flasher control</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"   version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"    version="2.0.0"/>
        <file category="include" name="SPL/Boards/"            version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_LEDs.h" version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_LEDs.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h" attr="config" version="2.0.0"/>
      </files>
    </component> 
    <component Cclass="Board Support" Cgroup="Buttons" Cversion="2.0" condition="CON_MDR_ALL">
      <description>Buttons control</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_Buttons.h" version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_Buttons.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="DisplayLCD" Cversion="2.0" condition="CON_MDR_CM1CM3">
      <description>Display MT 12864x control</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_LCD.h"     version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_LCD_Font.h"      version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_LCD_MT_12864x.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h"   attr="config" version="2.0.0"/>
      </files>
    </component>     
    <component Cclass="Board Support" Cgroup="DisplayLCD" Cversion="2.0" condition="CON_MDR1986VE4">
      <description>Display MT 10T7 control</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_LCD.h"     version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_LCD_MT_10T7.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h"   attr="config" version="2.0.0"/>
      </files>
    </component>     
    <component Cclass="Board Support" Cgroup="DisplayLCD" Cversion="2.0" condition="CON_MDR1986VK214">
      <description>Display XT13468PSPA control</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_LCD.h"     version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_LCD_XT13468PSPA.h" version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_LCD_XT13468PSPA.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h"  attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="DisplayLCD" Cversion="2.0" condition="CON_MDR1986VK234">
      <description>Display HTD B083 control</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_LCD.h"     version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_LCD_HTD_B083.h" version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_LCD_HTD_B083.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h"  attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="UART_Debug" Cversion="2.0" condition="CON_MDR_ALL">
      <description>UART Debug printf</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_UART_Debug.h" version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_UART_Debug.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h" attr="config" version="2.0.0"/>
      </files>
    </component>
