StartMilandr/MDR_Pack_v6/PACK_Gen/Milandr.MDR1986VExx.pdsc
    <component Cclass="Board Support" Cgroup="UART_PinSelect" Cversion="2.0" condition="CON_MDR_ALL">
      <description>UART pins definitions</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_UART_PinSelect.h" version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_UART_PinSelect.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h" attr="config" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SSP_PinSelect" Cversion="2.0" condition="CON_MDR_ALL">
      <description>UART pins definitions</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>
        <file category="header"  name="SPL/Boards/MDRB_SSP_PinSelect.h" version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_SSP_PinSelect.c" version="2.0.0"/>
        <file category="header"  name="SPL/Config/MDRB_BoardSelect.h" attr="config" version="2.0.0"/>
      </files>
    </component>    
    <component Cclass="Board Support" Cgroup="Timer_PinSelect" Cversion="2.0" condition="CON_MDR_ALL">
      <description>UART pins definitions</description>
      <files>
        <file category="include" name="SPL/Devices/Defines/"      version="2.0.0"/>
        <file category="include" name="SPL/Boards/Defines/"       version="2.0.0"/>
        <file category="include" name="SPL/Boards/"               version="2.0.0"/>      
        <file category="header"  name="SPL/Boards/MDRB_Timer_PinSelect.h" version="2.0.0"/>
        <file category="source"  name="SPL/Boards/MDRB_Timer_PinSelect.c" version="2.0.0"/>
      </files>
    </component>

  </components>

  <examples>
    <example name="LED Flasher" folder="Examples/All_Boards/LedFlasher" doc="ReadMe.md" version="2.0.0">
      <description>Board LED flashing</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="LED_Flasher.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <!--component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/-->
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="LED"          Cversion="2.0" condition="CON_MDR_ALL"/>
        <!--component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/-->
      </attributes>
    </example>

    <example name="Buttons Checker" folder="Examples/All_Boards/ButtonsChecker" doc="ReadMe.md" version="2.0.0">
      <description>Board LED flashing</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="ButtonsChecker.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <!--component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/-->
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="LED"          Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/>
      </attributes>
    </example>

    <example name="LCD String" folder="Examples/All_Boards/LCD_String" doc="ReadMe.md" version="2.0.0">
      <description>Board LED flashing</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="LCD_String.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="DisplayLCD"   Cversion="2.0"/>
      </attributes>
    </example>

    <example name="ClockTestCPU" folder="Examples/All_Boards/ClockTestCPU" doc="ReadMe.md" version="2.0.0">
      <description>Test CPU clock sources</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="ClockTestCPU.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="LED"          Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="DisplayLCD"   Cversion="2.0"/>
      </attributes>
    </example>    

