StartMilandr/MDR_Pack_v6/PACK_Gen/Milandr.MDR1986VExx.pdsc
    <example name="EEPROM_StoreData" folder="Examples/All_Boards/EEPROM_StoreData" doc="ReadMe.md" version="2.0.0">
      <description>Store data to EEPROM's main and info page. </description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="EEPROM_StoreData.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="DisplayLCD"   Cversion="2.0"/>
        <component Cclass="Drivers"       Cgroup="SysTimer"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="Backup and RTC"  Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="EEPROM"       Cversion="2.0" condition="CON_MDR_ALL"/>
      </attributes>
    </example>

    <example name="EEPROM_Test" folder="Examples/All_Boards/EEPROM_Test" doc="ReadMe.md" version="2.0.0">
      <description>Store data to EEPROM's main and info page. </description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="EEPROM_Test.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="DisplayLCD"   Cversion="2.0"/>
        <component Cclass="Drivers"       Cgroup="EEPROM"       Cversion="2.0" condition="CON_MDR_ALL"/>
      </attributes>
    </example>

    <example name="EEPROM_FLM" folder="Examples/All_Boards/EEPROM_FLM" doc="ReadMe.md" version="2.0.0">
      <description>Store data to EEPROM's main and info page. </description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="EEPROM_FLM.uvmpw"/>
      </project>
    </example>    

    <example name="ADC_Test" folder="Examples/All_Boards/ADC_Test" doc="ReadMe.md" version="2.0.0">
      <description>ADC SAR use cases</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="ADC_Test.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="ADC"          Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="PER_Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="SysTimer"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="DisplayLCD"   Cversion="2.0"/>
      </attributes>
    </example>

    <example name="SSP_Test" folder="Examples/All_Boards/SSP_Test" doc="ReadMe.md" version="2.0.0">
      <description>SSP use cases</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="SSP_Test.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="SSP"          Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="PER_Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="DisplayLCD"   Cversion="2.0"/>
      </attributes>
    </example>

    <example name="UART_Test" folder="Examples/All_Boards/UART_Test" doc="ReadMe.md" version="2.0.0">
      <description>UART use cases</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="UART_Test.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UART"         Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="PER_Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="UART_Debug"      Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="UART_PinSelect"  Cversion="2.0" condition="CON_MDR_ALL"/>
      </attributes>
    </example>

