StartMilandr/MDR_Pack_v6/PACK_Gen/Milandr.MDR1986VExx.pdsc
    <example name="Timer_Test" folder="Examples/All_Boards/Timer_Test" doc="ReadMe.md" version="2.0.0">
      <description>Timer use cases</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project>
        <environment name="uv" load="Timer_Test.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="Timer"         Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Drivers"       Cgroup="PER_Clock"    Cversion="2.0" condition="CON_MDR_ALL"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR_ALL"/>
      </attributes>
    </example>

    <example name="Timer_CapFix" folder="Examples/All_Boards/Timer_CapFix" doc="ReadMe.md" version="2.0.0">
      <description>Timer use cases</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="Timer_CapFix.uvprojx"/></project>
    </example>
    <example name="Power_Test" folder="Examples/All_Boards/Power_Test" doc="ReadMe.md" version="2.0.0">
      <description>Timer use cases</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="Power_Test.uvmpw"/></project>
    </example>
    <example name="CRC_Test" folder="Examples/All_Boards/CRC_Test" doc="ReadMe.md" version="2.0.0">
      <description>Timer use cases</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="CRC_Test.uvmpw"/></project>
    </example>
    <example name="I2C_Test" folder="Examples/All_Boards/I2C_Test" doc="ReadMe.md" version="2.0.0">
      <description>I2C use cases</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="I2C_Test.uvmpw"/></project>
    </example>
    <example name="DMA_ADC_PingPong" folder="Examples/All_Boards/DMA_Test/DMA_ADC_PingPong" doc="ReadMe.md" version="2.0.0">
      <description>DMA ping-pong ADC</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="DMA_ADC_PingPong.uvprojx"/></project>
    </example>
    <example name="DMA_Soft" folder="Examples/All_Boards/DMA_Test/DMA_Soft" doc="ReadMe.md" version="2.0.0">
      <description>DMA copy by Soft request</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="DMA_Soft.uvprojx"/></project>
    </example>
    <example name="DMA_SPI" folder="Examples/All_Boards/DMA_Test/DMA_SPI" doc="ReadMe.md" version="2.0.0">
      <description>SPI send and receive throught DMA</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="DMA_SPI.uvprojx"/></project>
    </example>
    <example name="DMA_UART" folder="Examples/All_Boards/DMA_Test/DMA_UART" doc="ReadMe.md" version="2.0.0">
      <description>UART send and receive throught DMA</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="DMA_UART.uvprojx"/></project>
    </example>
    <example name="1636RR52_Test" folder="Examples/All_Boards/1636RR52_Test" doc="ReadMe.md" version="2.0.0">
      <description>1636RR52 flash memory IC operations test</description>
      <board name="All_Boards" vendor="Milandr"/>
      <project><environment name="uv" load="1636RR52_Test.uvprojx"/></project>
    </example>

    <example name="VK214_ADCUI" folder="Examples/1986VK214/VK214_ADCUI" doc="ReadMe.md" version="2.0.0">
      <description>ADCUI Use cases</description>
      <board name="BRD_1986VK214" vendor="Milandr"/>
      <project>
        <environment name="uv" load="VK214_ADCUI.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR1986VK214"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR1986VK214"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR1986VK214"/>
        <component Cclass="Drivers"       Cgroup="ADCUI"        Cversion="2.0" condition="CON_MDR1986VK214"/>
        <component Cclass="Drivers"       Cgroup="PER_Clock"    Cversion="2.0" condition="CON_MDR1986VK214"/>
        <component Cclass="Drivers"       Cgroup="SysTimer"     Cversion="2.0" condition="CON_MDR1986VK214"/>
        <component Cclass="Drivers"       Cgroup="LCD"          Cversion="2.0" condition="CON_MDR1986VK214"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR1986VK214"/>
        <component Cclass="Board Support" Cgroup="DisplayLCD"   Cversion="2.0"/>
      </attributes>
    </example>


    <example name="VK234_ADCUI" folder="Examples/1986VK234/VK234_ADCUI" doc="ReadMe.md" version="2.0.0">
      <description>ADCUI Use cases</description>
      <board name="BRD_1986VK234" vendor="Milandr"/>
      <project>
        <environment name="uv" load="VK234_ADCUI.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS"         Cgroup="CORE"/>
        <component Cclass="Device"        Cgroup="Startup"/>
        <component Cclass="Drivers"       Cgroup="RST Clock"    Cversion="2.0" condition="CON_MDR1986VK234"/>
        <component Cclass="Drivers"       Cgroup="GPIO Port"    Cversion="2.0" condition="CON_MDR1986VK234"/>
        <component Cclass="Drivers"       Cgroup="UseFuncs"     Cversion="2.0" condition="CON_MDR1986VK234"/>
        <component Cclass="Drivers"       Cgroup="ADCUI"        Cversion="2.0" condition="CON_MDR1986VK234"/>
        <component Cclass="Drivers"       Cgroup="PER_Clock"    Cversion="2.0" condition="CON_MDR1986VK234"/>
        <component Cclass="Drivers"       Cgroup="SysTimer"     Cversion="2.0" condition="CON_MDR1986VK234"/>
        <component Cclass="Board Support" Cgroup="Buttons"      Cversion="2.0" condition="CON_MDR1986VK234"/>
        <component Cclass="Board Support" Cgroup="DisplayLCD"   Cversion="2.0"/>
      </attributes>
    </example>

  </examples>

  <boards>
    <board vendor="Milandr" name="All_Boards" revision="Vx" salesContact="info@milandr.ru" orderForm="http://www.milandr.ru">
      <description>Unspecified Milandr Board</description>
      <mountedDevice             deviceIndex="0" Dvendor="Milandr:99" Dname="MDR1986VE91"/>
      <compatibleDevice          deviceIndex="0" Dvendor="Milandr:99" Dfamily="StartMilandr"/>
      <debugInterface adapter="J-Link Lite"      connector="Mini-USB"/>
    </board>
    <board vendor="Milandr" name="BRD_1986VK214" revision="Vx" salesContact="info@milandr.ru" orderForm="http://www.milandr.ru">
      <description>1986VK214 Milandr Board</description>
      <mountedDevice             deviceIndex="0" Dvendor="Milandr:99" Dname="MDR1986VK214"/>
      <compatibleDevice          deviceIndex="0" Dvendor="Milandr:99" Dfamily="StartMilandr"/>
      <debugInterface adapter="J-Link Lite"      connector="Mini-USB"/>
    </board>
    <board vendor="Milandr" name="BRD_1986VK234" revision="Vx" salesContact="info@milandr.ru" orderForm="http://www.milandr.ru">
      <description>1986VK234 Milandr Board</description>
      <mountedDevice             deviceIndex="0" Dvendor="Milandr:99" Dname="MDR1986VK234"/>
      <compatibleDevice          deviceIndex="0" Dvendor="Milandr:99" Dfamily="StartMilandr"/>
      <debugInterface adapter="J-Link Lite"      connector="Mini-USB"/>
    </board>

  </boards>

</package>